app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---
  <ul>
    <% Post.all.each do |post| %>