app/controllers/posts_controller.rb

	def create
    @post=Post.create(post_params)
    @post.user = current_user
    @post.save
---
INSERT INTO "posts" ("link") VALUES ($1) RETURNING "id"  [["link", "http://ilarge.listal.com/image/768795/968full-amber-heard.jpg"]]
UPDATE "posts" SET "user_id" = $1 WHERE "posts"."id" = $2  [["user_id", 1], ["id", 2]]